[
    {
        "name": "Codecademy",
        "text": "Codecademy has been a vital part of my learning journey, offering courses from foundational programming to advanced technologies. I mastered web development essentials through the Full Stack Developer Career Path, focusing on HTML, CSS, JavaScript, and the PERN stack. This program taught me all facets of web development, including DevOps practices. I've also expanded my skills with courses in Next.js, Go, MongoDB, and more, enhancing my ability to leverage new technologies. Codecademy remains a key resource for my ongoing professional development, keeping me updated with the tech industry's latest advancements.",
        "url": "https://www.codecademy.com/catalog"
    },
    {
        "name": "FreeCodeCamp Javascript Blockchain Course",
        "text": "This is the first real full web3 learning tutorial that set me up with all the needed techniques to write smart contracts and deploy them. In this course, I learned Solidity smart contract programming, JavaScript for web3 development, Next.js framework, Tailwind CSS for CSS, HTML, IPFS. I have also learned core blockchain concepts such as ERC20, ERC721, DAO, DeFi, and much more. After this course, I could confidently write and deploy smart contracts. It is the best course regarding web3 and programming.",
        "url": "https://www.freecodecamp.org/news/learn-blockchain-solidity-full-stack-javascript-development/"
    },
    {
        "name": "Crypto Zombies",
        "text": "CryptoZombies is a very interesting online learning platform focusing on Solidity development. The courses are very well structured, and while you are learning, you are actually building a NFT game. I learned a lot about connecting smart contracts to each other, ERC20, ERC712, and a little frontend web3 development in React.",
        "url": "https://cryptozombies.io"
    },
    {
        "name": "Moralis Academy",
        "text": "Moralis Academy is the web3 online learning academy. Similar to Codecademy, they have courses teaching developers everything they need to know to start in web3 development. I was subscribed a couple of months because I was really interested in the creation of trading bots in JavaScript, and TradingView strategy development in PineScript. I also started Solidity development for the first time on the side.",
        "url": "https://academy.moralis.io"
    },
    {
        "name": "Udemy",
        "text": "Udemy is one of the biggest platforms where people can learn anything they want. The platform provides courses which users can buy. The courses are fairly cheap but provide a lot of knowledge. It has everything from yoga to software development. I bought a course on data analytics with PostgreSQL, where I learned everything about SQL environment and how to use it. It was very well structured and it was my first introduction into database management and analytics.",
        "url": "https://www.udemy.com"
    }
]
